Revit 2027 API
ItemSelectionDialogResult Enumeration
 An enumerated type listing the possible responses from a prompted dialog where the user is asked to select one or more items.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ItemSelectionDialogResult
Public Enumeration ItemSelectionDialogResult
public enum class ItemSelectionDialogResult
type ItemSelectionDialogResult
Members
Member name | Value | Description
Canceled | 1 |  The user canceled the prompted dialog. No selected item(s) are available from the dialog interfaces.
Confirmed | 0 |  The user selected one or more item(s) from the prompted dialog and confirmed the selection. The selected item(s) are available from the dialog interfaces.
See Also
Reference
Autodesk.Revit.UI Namespace